<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Specify ARCH to be "ARM" or "Intel". Downloads the current release version of SWITCHDrive and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.switchdrive</string>
	<key>Input</key>
	<dict>
		<key>ARCH</key>
		<string>ARM</string>
		<key>MUNKI_CATEGORY</key>
		<string>Storage</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/switch</string>
		<key>NAME</key>
		<string>SWITCHdrive</string>
		<key>pkginfo</key>
		<dict>
			<key>autoremove</key>
			<false/>
			<key>blocking_applications</key>
			<array>
				<string>switchdrive</string>
			</array>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>description</key>
			<string>SWITCHdrive – der akademische Cloud-Speicherdienst der Schweiz

Dateien sicher speichern, jederzeit mobil darauf zugreifen und mit anderen teilen: Das geht einfach und sicher mit SWITCHdrive.

Synchronisieren und Sharen: Hochschulangehörigen bietet SWITCHdrive eine sichere Alternative zu kommerziellen Cloud-Storage-Diensten. Damit können Dateien schnell und zuverlässig gespeichert, synchronisiert, mit anderen geteilt oder gemeinsam bearbeitet werden. 

Ihre Daten immer sicher dabei: Der akademische Cloud-Storage-Dienst lässt sich bequem per Browser, Desktop-Client oder mobiler App bedienen. Sämtliche Daten werden auf Servern im Schweizer Wissenschaftsnetz gespeichert.</string>
			<key>developer</key>
			<string>SWITCH</string>
			<key>display_name</key>
			<string>SWITCHdrive</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>unattended_uninstall</key>
			<true/>
			<key>uninstall_method</key>
			<string>removepackages</string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>0.2.0</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.switchdrive</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded</string>
				<key>flat_pkg_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>FlatPkgUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>pkg_payload_path</key>
				<string>%RECIPE_CACHE_DIR%/expanded/SWITCHdrive.pkg/Payload</string>
			</dict>
			<key>Processor</key>
			<string>PkgPayloadUnpacker</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpack/Applications/SWITCHdrive.app/Contents/Info.plist</string>
				<key>plist_version_key</key>
				<string>CFBundleVersion</string>
			</dict>
			<key>Processor</key>
			<string>Versioner</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>faux_root</key>
				<string>%RECIPE_CACHE_DIR%/unpack</string>
				<key>installs_item_paths</key>
				<array>
					<string>/Applications/switchdrive.app</string>
				</array>
			</dict>
			<key>Processor</key>
			<string>MunkiInstallsItemsCreator</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>munkiimport_appname</key>
				<string>SWITCHDrive.app</string>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
