<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of Spartan from www.wavefun.com
			The Processor AppDmgVersioner is used to read out the Bundle ID and App name. The version info is not used.
		</string>
		<key>Identifier</key>
		<string>com.github.its-unibas.download.spartan</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>Spartan</string>
			<key>SEARCH_PATTERN</key>
			<string>https:\/\/downloads-s3\.wavefun\.com\/mac\/Spartan\d+V\d+\.dmg</string>
			<key>SEARCH_URL</key>
			<string>https://www.wavefun.com/downloads</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.0</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>re_pattern</key>
					<string>%SEARCH_PATTERN%</string>
					<key>url</key>
					<string>%SEARCH_URL%</string>
				</dict>
				<key>Processor</key>
				<string>URLTextSearcher</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%match%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>dmg_path</key>
					<string>%pathname%</string>
				</dict>
				<key>Processor</key>
				<string>AppDmgVersioner</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/%app_name%</string>
					<key>requirement</key>
					<string>identifier "%bundleid%" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = S9C62N29P8</string>
				</dict>
			</dict>
		</array>
	</dict>
</plist>
