<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the latest version of OMERO.insight from GitHub and imports into Munki.</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.munki.omero-insight</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OMERO.insight</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Science</string>
            <key>description</key>
            <string> The OMERO.insight Project is a sub-project of the Open Microscopy Environment
				Project, &lt;a href=&quot;https://www.openmicroscopy.org/&quot;&gt;OME&lt;/a&gt; that focuses on delivering a
				client for the visualization and manipulation of both image data and metadata
				maintained at an OMERO server site.
				OMERO.insight is completely written in Java.
				Technical documentation can be found &lt;a href=&quot;https://omero-insight.readthedocs.io/en/latest/&quot;&gt;here&lt;/a&gt;.</string> 
            <key>developer</key>
            <string>OME</string>
            <key>display_name</key>
            <string>%NAME%</string>
            <key>minimum_os_version</key>
            <string>10.7.0</string>
            <key>name</key>
            <string>%NAME%</string>
            <key>unattended_install</key>
            <true />
        </dict>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.download.omero-insight</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
                <dict>
                    <key>additional_pkginfo</key>
                    <dict>
                        <key>version</key>
                        <string>%version%</string>
                    </dict>
                </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
