<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Recipe for the latest version of Unipro Ugene </string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.Unipro_Ugene</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Ugene</string>
        <key>SEARCH_PATTERN</key>
        <string>ugene-.{4,6}-mac-x86-64\.dmg</string>
        <key>GITHUB_REPO</key>
        <string>ugeneunipro/ugene</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Arguments</key>
            <dict>
                <key>asset_regex</key>
                <string>%SEARCH_PATTERN%</string>
                <key>github_repo</key>
                <string>%GITHUB_REPO%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%-%version%.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
