<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download Recipe for the latest version of Unipro Ugene </string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.Unipro_Ugene</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Ugene</string>
        <key>SEARCH_PATTERN</key>
        <string>href="(.*ugene\.unipro\.ru\/downloads\/packages\/.*\/ugene-.*-mac-.*\.dmg)"</string>
        <key>SEARCH_URL</key>
        <string>http://ugene.net/downloads/ugene_get_latest_mac_x86_64.html</string>
        <key>DISABLE_CODE_SIGNATURE_VERIFICATION</key>
        <true />
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.2</string>
    <key>Process</key>
    <array>
        <dict>
                <key>Arguments</key>
                <dict>
                    <key>re_pattern</key>
                    <string>%SEARCH_PATTERN%</string>
                    <key>url</key>
                    <string>%SEARCH_URL%</string>
                </dict>
                <key>Processor</key>
                <string>URLTextSearcher</string>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>%NAME%.dmg</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>