<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Download Recipe for the latest update for Maple</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.download.MapleUpdate</string>
	<key>Input</key>
	<dict>
		<key>MajorVersion</key>
		<string>2024</string>
		<key>NAME</key>
		<string>MapleUpdate</string>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>href="(/support/downloads/m%MajorVersion%_\d+update.aspx)"</string>
				<key>url</key>
				<string>https://de.maplesoft.com/support/downloads/index.aspx</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.dmg</string>
				<key>url</key>
				<string>https://de.maplesoft.com%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
