<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads and imports the latest update for Maple into Munki.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.MapleUpdate</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>MapleUpdate</string>
        <key>MajorVersion</key>
		<string>2021</string>
		<key>MUNKI_REPO_SUBDIR</key>
        <string>apps/Maple</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>category</key>
            <string>Science</string>
            <key>description</key>
            <string>Maple is the ultimate productivity tool for solving mathematical problems and creating interactive technical applications.

				Intuitive and easy to use, it delivers the most advanced, complete, reliable mathematical capabilities that can only come from a market-leading tool that has been developed and tested over 25 years.
				
				Maple allows you to create rich, executable technical documents that provide both the answer and the thinking behind the analysis. Maple documents seamlessly combine numeric and symbolic calculations, explorations, mathematical notation, documentation, buttons and sliders, graphics, and animations that can be shared and reused by your colleagues.</string> 
            <key>developer</key>
            <string>Maplesoft</string>
            <key>display_name</key>
            <string>%NAME% %MajorVersion%</string>
            <key>minimum_os_version</key>
            <string>10.12.0</string>
            <key>name</key>
            <string>%NAME% %MajorVersion%</string>
            <key>unattended_install</key>
            <true/>
            <key>update_for</key>
			<array>
				<string>Maple</string>
			</array>
        </dict>
	</dict>
	<key>MiniumumVersion</key>
	<string>1.0</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.MapleUpdate</string>
	<key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>version</key>
                    <string>%VERSION%</string>
                    <key>installcheck_script</key>
                    <string>#!/bin/sh
# Check for existing receipt and version
VERSION_FILE="/Library/Frameworks/Maple.framework/Versions/Current/license/version.txt"
VERSION="%VERSION%"
                        
read -r INSTALLED_VERSION &lt; "$VERSION_FILE"
                   
if [ "$INSTALLED_VERSION" != "$VERSION" ] &amp;&amp; [[ "$INSTALLED_VERSION" &lt; "$VERSION" ]]; then
    exit 0
else
    exit 1
fi
                    </string>
                    <key>postinstall_script</key>
                    <string>#!/bin/sh
# run the installer
/usr/bin/sudo /private/tmp/Maple2021.2MacUpgrade.app/Contents/MacOS/installbuilder.sh --mode unattended 
    
# remove the toolkit installer app
file_path="/Applications/Maple 2021/MapleToolbox2021.2MacInstaller.app"
if [ -e "$file_path" ];then
/usr/bin/sudo /bin/rm -rf /Applications/Maple\ 2021/MapleToolbox2021.2MacInstaller.app
echo "Removed toolbox installer"
fi
                    
# remove the installer app
file_path="/private/tmp/Maple2021.2MacUpgrade.app"
if [ -e "$file_path" ];then
/usr/bin/sudo /bin/rm -rf "$file_path"
echo "Removed Maple Installer"
fi
                    
# remove link to uninstaller
file_path="/Applications/Maple 2021/Uninstall Maple 2021"
if [ -e "$file_path" ];then
/usr/bin/sudo /bin/rm /Applications/Maple\ 2021/Uninstall\ Maple\ 2021
echo "Removed Maple Uninstaller"
fi
                    </string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>    
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>additional_makepkginfo_options</key>
				<array>
					<string>--destinationpath=/private/tmp</string>
				</array>
                <key>pkg_path</key>
                <string>%pathname%</string>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
            </dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
        </dict>
    </array>
</dict>
</plist>
