<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads FlowJo</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.download.FlowJo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>FlowJo</string>
        <key>INDEX_URL</key>
        <string>https://www.flowjo.com/solutions/flowjo/downloads</string>
        <key>SEARCH_PATTERN_URL</key>
    	<string>(https://downloads.bdaccessportal.com/v11/mac/x64/FlowJo-(?P&lt;version&gt;[0-9][0-9].[0-9]?[0-9].[0-9]?[0-9])-x64.dmg)</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Process</key>
    <array>
      <dict>
  			<key>Arguments</key>
  			<dict>
  				<key>re_pattern</key>
  				<string>%SEARCH_PATTERN_URL%</string>
  				<key>url</key>
  				<string>%INDEX_URL%</string>
  			</dict>
  			<key>Processor</key>
  			<string>URLTextSearcher</string>
  		</dict>
  		<dict>
  			<key>Arguments</key>
  			<dict>
  				<key>filename</key>
  				<string>%NAME%.dmg</string>
  				<key>url</key>
  				<string>%match%</string>
  			</dict>
  			<key>Processor</key>
  			<string>URLDownloader</string>
  		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%pathname%/FlowJo.app</string>
                <key>requirement</key>
                <string>identifier "com.flowjo.flowjo" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = C79HU5AD9V</string>
            </dict>
            <key>Processor</key>
            <string>CodeSignatureVerifier</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
