<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads FlowJo and imports into munki.
</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.FlowJo</string>
	<key>Input</key>
	<dict>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>NAME</key>
		<string>FlowJo</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>testing</string>
			</array>
			<key>category</key>
			<string>Science</string>
			<key>description</key>
			<string>The FlowJo® workspace is a powerful statistical environment that is used for immunophenotyping, cell cycle, proliferation, kinetics studies, quantitative population comparison, or plate screening assays to name a few.</string>
			<key>developer</key>
			<string>FlowJo</string>
			<key>display_name</key>
			<string>FlowJo</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>unattended_install</key>
			<true/>
			<key>items_to_copy</key>
	    <array>
	        <dict>
			<key>destination_path</key>
			<string>/Applications</string>
			<key>source_item</key>
			<string>FlowJo.app</string>
		 </dict>
		 <dict>
			<key>destination_path</key>
			<string>/Applications/FlowJo.app/Contents/Resources</string>
			<key>source_item</key>
			<string>plugins</string>
		 </dict>
	    </array>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# FlowJo offers a plugin system, where the user can add new plugins by
# adding them to a plugins folder in the Application folder.
# To prevent confusion we create a new folder called "Plugins for FlowJo"
# (instead of just plugins) and link it with the now invisible plugins folder.
cd /Applications
ln -s /Applications/FlowJo.app/Contents/Resources/plugins/
ln -s /Applications/FlowJo.app/Contents/Resources/plugins/ "Plugins for FlowJo"
chflags -h hidden plugins
cd /Applications/FlowJo.app/Contents/Resources/
chmod 777 plugins
			</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
rm -rf /Applications/plugins
rm -rf "/Applications/Plugins for FlowJo"
			</string>
		</dict>
	</dict>
	<key>MinimumVersion</key>
	<string>1.0.0</string>
	<key>ParentRecipe</key>
	<string>com.github.its-unibas.download.FlowJo</string>
	<key>Process</key>
	<array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>re_pattern</key>
                <string>OS X ([0-9]+(\.[0-9]+)+) or later</string>
                <key>result_output_var_name</key>
                <string>min_os_ver</string>
                <key>url</key>
                <string>https://flowjo.com/flowjo/download</string>
            </dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
        </dict>
        <dict>
             <key>Arguments</key>
             <dict>
                <key>additional_pkginfo</key>
                <dict>
                    <key>minimum_os_version</key>
                    <string>%min_os_ver%</string>
                </dict>
            </dict>
            <key>Processor</key>
            <string>MunkiPkginfoMerger</string>
        </dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
