<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the current release version of Anaconda and imports it into Munki.</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.munki.Anaconda3</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Anaconda</string>
		<key>PYTHON_MAJOR_VERSION</key>
		<string>3</string>
		<key>INSTALLER_TYPE</key>
		<string>pkg</string>
		<key>MUNKI_CATALOGS</key>
		<string>testing</string>
		<key>MUNKI_CATEGORY</key>
		<string>Science</string>
		<key>MUNKI_DEVELOPER</key>
		<string>Continuum</string>
		<key>MUNKI_REPO_SUBDIR</key>
		<string>apps/%NAME%</string>
		<key>pkginfo</key>
		<dict>
			<key>catalogs</key>
			<array>
				<string>%MUNKI_CATALOGS%</string>
			</array>
			<key>category</key>
			<string>%MUNKI_CATEGORY%</string>
			<key>description</key>
			<string>Anaconda is the leading open data science platform powered by Python. The open source version of Anaconda is a high performance distribution of Python and R and includes over 100 of the most popular Python, R and Scala packages for data science.
For information about working with Anaconda have a look at the following documentation: &lt;a href="https://docs.conda.io/projects/conda/en/latest/user-guide/tasks/manage-environments.html" target="_blank"&gt;Anaconda3 Documentation&lt;/a&gt;</string>
			<key>developer</key>
			<string>%MUNKI_DEVELOPER%</string>
			<key>display_name</key>
			<string>%NAME%</string>
			<key>name</key>
			<string>%NAME%</string>
			<key>requires</key>
			<array>
				<string>python3</string>
			</array>
			<key>postinstall_script</key>
			<string>#!/bin/bash
# Add conda to path
echo '/opt/anaconda3/bin' >> /etc/paths.d/com.github.its-unibas.munki.Anaconda3
</string>
			<key>postuninstall_script</key>
			<string>#!/bin/bash
# Cleanup
rm -rf "/Applications/Anaconda-Navigator.app"
rm -rf "/anaconda3"
rm /etc/paths.d/com.github.its-unibas.munki.Anaconda3
exit 0
			</string>
			<key>uninstall_method</key>
			<string>removepackages</string>
			<key>uninstallable</key>
			<true/>
		</dict>
	</dict>
	<key>ParentRecipe</key>
	<string>com.github.hansen-m.download.Anaconda</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>additional_pkginfo</key>
				<dict>
					<key>version</key>
					<string>%version%</string>
				</dict>
			</dict>
			<key>Processor</key>
			<string>MunkiPkginfoMerger</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pkg_path</key>
				<string>%pathname%</string>
				<key>repo_subdirectory</key>
				<string>%MUNKI_REPO_SUBDIR%</string>
			</dict>
			<key>Processor</key>
			<string>MunkiImporter</string>
		</dict>
	</array>
</dict>
</plist>
