<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips, verifies and packages the installer of the latest version of DoNotDisturb by Objective-See.</string>
    <key>Identifier</key>
    <string>com.github.its-unibas.pkg.DoNotDisturb</string>
    <key>MinimumVersion</key>
    <string>0.6.0</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Do Not Disturb</string>
    </dict>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.download.DoNotDisturb</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkgdirs</key>
                <dict>
                    <key>usr/local/var/dnd</key>
                    <string>0775</string>
                </dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/pkg</string>
            </dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileMover</string>
            <key>Arguments</key>
            <dict>
                <key>source</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%/%NAME% Installer.app</string>
                <key>target</key>
                <string>%pkgroot%/usr/local/var/dnd/%NAME% Installer.app</string>
            </dict>
        </dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME% Installer-%version%</string>
                    <key>version</key>
                    <string>%version%</string>
                    <key>id</key>
                    <string>com.objective-see.dnd.installer</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr/local/var/dnd</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>admin</string>
                        </dict>
                    </array>
                </dict>
            </dict>
            <key>Processor</key>
            <string>PkgCreator</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>

    </array>
</dict>
</plist>