<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips, verifies, packages and imports the installer of the latest version of DoNotDisturb by Objective-See into munki. The app itself is installed and uninstalled through the shell scripts.</string> 
    <key>Identifier</key>
    <string>com.github.its-unibas.munki.DoNotDisturb</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.pkg.DoNotDisturb</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Do Not Disturb (DND) is a free, open-source utility that aims to detect and alert you of "evil maid" attacks</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
<!-- The following scripts install and uninstall the app by simulating a user clicking the "install" and uninstall buttons
within the Installer app. The script has been modeled after the scripts in com.github.its-unibas.munki.OverSight -->
            <key>postinstall_script</key>
            <string>#!/bin/sh
#This mimicks a user clicking the "Install" button on the Installer app
"/usr/local/var/dnd/Do Not Disturb Installer.app/Contents/MacOS/Do Not Disturb Installer" "-install"

exit 0
            </string>
            <key>preuninstall_script</key>
            <string>#!/bin/sh
#This mimicks a user clicking the "Uninstall" button on the Installer app
"/usr/local/var/dnd/Do Not Disturb Installer.app/Contents/MacOS/Do Not Disturb Installer" "-uninstall"

rm -rf "/usr/local/var/dnd/Do Not Disturb Installer.app"

exit 0
            </string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME% Installer-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>