<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips, verifies, packages and imports the installer of the latest version of DoNotDisturb by Objective-See into munki.</string> 
    <key>Identifier</key>
    <string>com.github.its-unibas.munki.DoNotDisturb</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.pkg.DoNotDisturb</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Do Not Disturb (DND) is a free, open-source utility that aims to detect and alert you of "evil maid" attacks</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
            <key>postinstall_script</key>
            <string>#!/bin/sh
sudo "/Applications/Do Not Disturb Installer.app/Contents/MacOS/%NAME% Installer"
rm -rf "/Applications/%NAME% Installer.app/"
exit 0
            </string>
            <key>preuninstall_script</key>
            <string>#!/bin/sh
//close application if open
pkill "Do Not Disturb"

"/Library/Objective-See/DND/Do Not Disturb.bundle/Contents/MacOS/Do Not Disturb" "-uninstall"

launchctl unload /Library/LaunchDaemons/com.objective-see.dnd.plist

rm /Library/LaunchDaemons/com.objective-see.dnd.plist

//Remove application
rm -rf "/Applications/Do Not Disturb.app"

rm -rf /Library/Objective-See/DND

killall "Do Not Disturb Helper"

exit 0
            </string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME% Installer-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>