<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads, unzips, verifies, packages and imports the installer of the latest version of RansomWhere by Objective-See into munki. The app itself is installed and uninstalled through shell scripts.</string> 
    <key>Identifier</key>
    <string>com.github.its-unibas.munki.RansomWhere</string>
    <key>ParentRecipe</key>
    <string>com.github.its-unibas.pkg.RansomWhere</string>
    <key>MinimumVersion</key>
    <string>1.0.0</string>
    <key>Input</key>
    <dict>
        <key>MUNKI_NAME</key>
        <string>%NAME%</string>
        <key>MUNKI_REPO_SUBDIR</key>
        <string>apps/%NAME%</string>
        <key>MUNKI_CATEGORY</key>
        <string>Utilities</string>
        <key>MUNKI_DEVELOPER</key>
        <string>Objective-See</string>
        <key>DISPLAY_NAME</key>
        <string>%NAME%</string>
        <key>pkginfo</key>
        <dict>
            <key>catalogs</key>
            <array>
                <string>testing</string>
            </array>
            <key>description</key>
            <string>Continually monitors the file-system for the creation of encrypted files by suspicious processes (i.e. ransomware).</string>
            <key>display_name</key>
            <string>%DISPLAY_NAME%</string>
            <key>name</key>
            <string>%MUNKI_NAME%</string>
            <key>unattended_install</key>
            <true/>
            <key>category</key>
            <string>%MUNKI_CATEGORY%</string>
            <key>developer</key>
            <string>%MUNKI_DEVELOPER%</string>
<!-- The following scripts install and uninstall the app by simulating a user clicking the "install" and "uninstall" buttons within the Installer app. 
The main functionality has been taken directly from the Software's author: https://objective-see.org/products/ransomwhere.html -->
            <key>postinstall_script</key>
            <string>#!/bin/sh
mv "/Applications/RansomWhere_Installer.app" "/usr/local/var"

#Simulating user pressing install button in the Installer app
"/usr/local/var/Ransomwhere_Installer.app/Contents/MacOS/RansomWhere_Installer" "-install"

exit 0
            </string>
            <key>preuninstall_script</key>
            <string>#!/bin/sh
#Simulating user pressing uninstall button in the Installer app
"/usr/local/var/Ransomwhere_Installer.app/Contents/MacOS/RansomWhere_Installer" "-uninstall"

rm -rf /usr/local/var/RansomWhere_Installer.app
exit 0
            </string>
        </dict>
    </dict>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>MunkiImporter</string>
            <key>Arguments</key>
            <dict>
                <key>repo_subdirectory</key>
                <string>%MUNKI_REPO_SUBDIR%</string>
                <key>pkg_path</key>
                <string>%RECIPE_CACHE_DIR%/%NAME%_Installer-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>