<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
    <dict>
        <key>Description</key>
        <string>Downloads the latest Intellij disk image and imports into Munki.
Defaults to the Intellij Community Edition for intel architecture. Override the following keys for other versions:
For macOS Silicon: 
    - arch == "aarch64"
For IntelliJ Ultimate Edition: 
    - CODESIGNATUREAPPNAME == "IntelliJ IDEA.app"
    - CODESIGNATUREREQUIREMENT == "identifier "com.jetbrains.intellij" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "2ZEFAR8TH3""
    - edition == "U"</string>
        <key>Identifier</key>
        <string>com.github.its-unibas.munki.Intellij</string>
        <key>Input</key>
        <dict>
            <key>arch</key>
            <string>intel</string>
            <key>MUNKI_REPO_SUBDIR</key>
            <string>apps/JetBrains/Intellij</string>
            <key>NAME</key>
            <string>Intellij</string>
            <key>edition</key>
            <string>C</string>
            <key>pkginfo</key>
            <dict>
                <key>catalogs</key>
                <array>
                    <string>testing</string>
                </array>
                <key>category</key>
                <string>Productivity</string>
                <key>description</key>
                <string>Lightweight IDE for Java SE, Groovy and Scala development.</string>
                <key>developer</key>
                <string>JetBrains</string>
                <key>display_name</key>
                <string>%NAME%</string>
                <key>name</key>
                <string>%NAME%</string>
                <key>unattended_install</key>
                <true/>
            </dict>
        </dict>
        <key>MinimumVersion</key>
        <string>0.2.0</string>
        <key>ParentRecipe</key>
        <string>com.github.its-unibas.download.Intellij</string>
        <key>Process</key>
        <array>
            <dict>
                <key>Arguments</key>
                <dict>
                    <key>pkg_path</key>
                    <string>%pathname%</string>
                    <key>repo_subdirectory</key>
                    <string>%MUNKI_REPO_SUBDIR%</string>
                </dict>
                <key>Processor</key>
                <string>MunkiImporter</string>
            </dict>
        </array>
    </dict>
</plist>
