<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
	<dict>
		<key>Description</key>
		<string>Downloads the latest version of QGIS, a free and open-source geographic information system</string>
		<key>Identifier</key>
		<string>com.github.its-unibas.download.QGIS</string>
		<key>Input</key>
		<dict>
			<key>NAME</key>
			<string>QGIS</string>
			<key>DOWNLOAD_URL</key>
			<string>https://qgis.org/downloads/macos/qgis-macos-pr.dmg</string>
		</dict>
		<key>MinimumVersion</key>
		<string>1.1</string>
		<key>Process</key>
		<array>
			<dict>
				<key>Processor</key>
				<string>DeprecationWarning</string>
				<key>Arguments</key>
				<dict>
					<key>warning_message</key>
					<string>Consider switching to the QGIS download or pkg recipes in the mlbz521-recipes repo or the QGIS munki recipe in the robperc-recipes repo. This recipe is deprecated and will be removed in the future.</string>
				</dict>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>url</key>
					<string>%DOWNLOAD_URL%</string>
					<key>filename</key>
					<string>%NAME%.dmg</string>
				</dict>
				<key>Processor</key>
				<string>URLDownloader</string>
			</dict>
			<dict>
				<key>Processor</key>
				<string>EndOfCheckPhase</string>
			</dict>
			<dict>
				<key>Arguments</key>
				<dict>
					<key>input_path</key>
					<string>%pathname%/QGIS*.app</string>
					<key>Requirement</key>
					<string>identifier "org.qgis.qgis3" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = "4F7N4UDA22"</string>
				</dict>
				<key>Processor</key>
				<string>CodeSignatureVerifier</string>
			</dict>
		</array>
	</dict>
</plist>
