<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest (unlicensed) version of f4transkript</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.download.f4transkript</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>f4transkript</string>
		<key>DOWNLOAD_URL</key>
		<string>https://www.audiotranskription.de/en/downloads/</string>
		<!--<string>https://www.audiotranskription.de/en//?smd_process_download=1&amp;download_id=2544</string>-->
		<key>REGEX</key>
		<!--<string>^.*href=\"(.*download_id=[0-9]*)\".*title=\"f4transkript macOS\".*$</string>-->
		<string>id=(\d\d\d\d).*title="f4transkript\smacOS</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%REGEX%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%.zip</string>
				<key>url</key>
				<string>https://www.audiotranskription.de/en//?smd_process_download=1&amp;download_id=%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
	</array>
</dict>
</plist>
