<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Description</key>
	<string>Downloads the latest (unlicensed) version of f4transkript</string>
	<key>Identifier</key>
	<string>com.github.its-unibas.download.f4transkript</string>
	<key>Input</key>
	<dict>
		<key>DOWNLOAD_URL</key>
		<string>https://www.audiotranskription.de/en/downloads/</string>
		<key>NAME</key>
		<string>f4transkript</string>
		<key>REGEX</key>
		<string>https:\/\/download.audiotranskription.de\/f4-\d+.\d+.\d+-mac\.zip</string>
	</dict>
	<key>MinimumVersion</key>
	<string>1.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>re_pattern</key>
				<string>%REGEX%</string>
				<key>url</key>
				<string>%DOWNLOAD_URL%</string>
			</dict>
			<key>Processor</key>
			<string>URLTextSearcher</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>url</key>
				<string>%match%</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>archive_path</key>
				<string>%pathname%</string>
			</dict>
			<key>Processor</key>
			<string>Unarchiver</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/f4transkript/f4*.app</string>
			</dict>
			<key>Processor</key>
			<string>FileFinder</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>source</key>
				<string>%found_filename%</string>
				<key>target</key>
				<string>%RECIPE_CACHE_DIR%/f4transkript/f4transkript.app</string>
			</dict>
			<key>Processor</key>
			<string>FileMover</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>input_path</key>
				<string>%RECIPE_CACHE_DIR%/f4transkript/f4transkript.app</string>
				<key>requirement</key>
				<string>identifier "de.audiotranskription.f4" and anchor apple generic and certificate 1[field.1.2.840.113635.100.6.2.6] /* exists */ and certificate leaf[field.1.2.840.113635.100.6.1.13] /* exists */ and certificate leaf[subject.OU] = L3Y9ZR6QBW</string>
			</dict>
			<key>Processor</key>
			<string>CodeSignatureVerifier</string>
		</dict>
	</array>
</dict>
</plist>
